tutorials/multiRegion/CHT/shellAndTubeHeatExchanger/0/tube/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/tube";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    lower
    {
        type            fixedValue;
        value           $internalField;
    }
    upper
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    walls
    {
        type            zeroGradient;
    }
    tube_to_solid
    {
        type            coupledTemperature;
        value           $internalField;
    }
}

// ************************************************************************* //
